---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCLevelInfo
source: html/9f287338-fe0c-383b-58be-39105d704a9f.htm
---
# Autodesk.Revit.DB.IFC.IFCLevelInfo

Represents information about a particular level in the document.

## Syntax (C#)
```csharp
public class IFCLevelInfo : IDisposable
```

## Remarks
Level information includes the height, which is the distance to from this level
 to the next available level, and the actual elevation of the level, in the Revit default units.